app/controllers/todo_items_controller.rb

    def create
        @todo_item = @todo_list.todo_items.create(todo_item_params)  #@todo_list.todo_items.cr~ yg ni cerita pasal association
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "refurbrbished"], ["todo_list_id", 37], ["created_at", "2020-01-13 05:40:58.662532"], ["updated_at", "2020-01-13 05:40:58.662532"]]

    def destroy
        @todo_item = @todo_list.todo_items.find(params[:id])
        if @todo_item.destroy
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = $1 AND "todo_items"."id" = $2 LIMIT $3  [["todo_list_id", 36], ["id", 2], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", 2]]

       def complete
        @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = $1, "updated_at" = $2 WHERE "todo_items"."id" = $3  [["completed_at", "2020-01-13 05:41:05.055898"], ["updated_at", "2020-01-13 05:41:05.056898"], ["id", 4]]