app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "wash car"], ["description", "go to carwash at 3pm"], ["created_at", "2020-01-12 04:33:52.557458"], ["updated_at", "2020-01-12 04:33:52.557458"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])